app/controllers/students_controller.rb

    def show
        @students = Students.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def index
        @student = Students.all
---
SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        @student = Students.new(params.require(:student).permit(:first_name, :last_name, :address))

        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "aniruddha"], ["last_name", "chaudhari"], ["address", "puned xscs"], ["created_at", "2024-07-15 07:50:27.589680"], ["updated_at", "2024-07-15 07:50:27.589680"]]